# Pandas

**pandas** is an open source library providing high-performance, easy-to-use data structures and data analysis tools for the Python programming language.

If we need to store different data types in the same place for numpy operations; we need pandas.

**Data structures explained below:** pandas series, pandas dataframe

## Pandas Series

### Creating pandas series from list

In [1]:
import numpy as np
import pandas as pd

In [2]:
pd.Series([1,2,3,4])

0    1
1    2
2    3
3    4
dtype: int64

**series also show indexes**

In [3]:
serim1 = pd.Series([1,2,3,4])

In [4]:
type(serim1)

pandas.core.series.Series

In [5]:
serim1.axes

[RangeIndex(start=0, stop=4, step=1)]

In [6]:
serim1.dtype

dtype('int64')

In [7]:
serim1.empty

False

In [8]:
serim1.ndim

1

In [9]:
serim1.size

4

In [10]:
serim1.values

array([1, 2, 3, 4])

**getting first two values of a series:**

In [11]:
serim1.head(2)

0    1
1    2
dtype: int64

In [12]:
serim1[0:3]

0    1
1    2
2    3
dtype: int64

**getting last two values of a series:**

In [13]:
serim1.tail(2)

2    3
3    4
dtype: int64

### Creating pandas series from numpy array

In [14]:
numar1 = np.array([1,2,3,4,5])
numar1

array([1, 2, 3, 4, 5])

In [15]:
type(numar1)

numpy.ndarray

In [16]:
serim2 = pd.Series(numar1)

In [17]:
serim2

0    1
1    2
2    3
3    4
4    5
dtype: int64

**assigning index:**

In [18]:
serim2.index

RangeIndex(start=0, stop=5, step=1)

In [19]:
serim2[0]

1

In [20]:
pd.Series([1,5,0.8,54], index = [1,2,5,7])

1     1.0
2     5.0
5     0.8
7    54.0
dtype: float64

**we don't have to use only numbers for indexing:**

In [21]:
serim3 = pd.Series([1,5,0.8,54], index = ['a','b','c','d'])
serim3

a     1.0
b     5.0
c     0.8
d    54.0
dtype: float64

In [22]:
serim3['a']

1.0

In [23]:
sozluk1 = {'reg' : 10, 'loj' : 11, 'cart' : 12}
sozluk1

{'reg': 10, 'loj': 11, 'cart': 12}

In [24]:
serim4 = pd.Series(sozluk1)
serim4

reg     10
loj     11
cart    12
dtype: int64

In [25]:
serim4['reg']

10

In [26]:
serim4['loj':'cart']

loj     11
cart    12
dtype: int64

In [27]:
serim4

reg     10
loj     11
cart    12
dtype: int64

In [28]:
pd.concat([serim4,serim4])

reg     10
loj     11
cart    12
reg     10
loj     11
cart    12
dtype: int64

In [29]:
serim4.append(serim4)

reg     10
loj     11
cart    12
reg     10
loj     11
cart    12
dtype: int64

In [30]:
serim4

reg     10
loj     11
cart    12
dtype: int64

### Element operations in series

In [31]:
numpar1 = np.array([1,2,3,33,55,66])
serimm1 = pd.Series(numar1)
serimm1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [32]:
serimm1[0]

1

In [33]:
serimm1[0:3]

0    1
1    2
2    3
dtype: int64

In [34]:
serimm2 = pd.Series([12, 23, 34, 45], index=["reg", "loj", "cart", "rf"])
serimm2

reg     12
loj     23
cart    34
rf      45
dtype: int64

**getting indexes:**

In [35]:
serimm2.index

Index(['reg', 'loj', 'cart', 'rf'], dtype='object')

In [36]:
serimm2.keys

<bound method Series.keys of reg     12
loj     23
cart    34
rf      45
dtype: int64>

**getting only values:**

In [37]:
serimm2.values

array([12, 23, 34, 45])

**getting values and index together:**

In [38]:
list(serimm2.items())

[('reg', 12), ('loj', 23), ('cart', 34), ('rf', 45)]

**element query:**

In [39]:
serimm2

reg     12
loj     23
cart    34
rf      45
dtype: int64

In [40]:
"knn" in serimm2

False

In [41]:
"reg" in serimm2

True

In [42]:
serimm2["reg"]

12

In [43]:
serimm2[['rf', 'reg']]

rf     45
reg    12
dtype: int64

**changing value of an element:**

In [44]:
serimm2["rf"] = 147

In [45]:
serimm2

reg      12
loj      23
cart     34
rf      147
dtype: int64

In [46]:
serimm2['reg' : 'cart']

reg     12
loj     23
cart    34
dtype: int64

In [47]:
serimm2[0:2]

reg    12
loj    23
dtype: int64

### Conditional operations

In [48]:
serimm3 = pd.Series([121, 234, 346, 454], index=["reg", "loj", "cart", "rf"])
serimm3

reg     121
loj     234
cart    346
rf      454
dtype: int64

In [49]:
serimm3[(serimm3>120) & (serimm3<250)]

reg    121
loj    234
dtype: int64

### Index problems in series

In [50]:
datap1 = pd.Series(['a', 'b', 'c'], index=[1,3,5])
datap1

1    a
3    b
5    c
dtype: object

In [51]:
datap1[0]

KeyError: 0

In [52]:
datap1[1]

'a'

In [53]:
datap1[1:3]

3    b
5    c
dtype: object

In [54]:
datap1[0:3]

1    a
3    b
5    c
dtype: object

**index behaved differently for slicing and element query!**  
**we can use loc and iloc to avoid confusion**

#### loc - label based indexing

In [55]:
datap1

1    a
3    b
5    c
dtype: object

In [56]:
datap1.loc[5]

'c'

In [57]:
datap1.loc[0:2]

1    a
dtype: object

In [58]:
datap1.loc[1:5]

1    a
3    b
5    c
dtype: object

#### iloc - positional indexing

In [59]:
datap1

1    a
3    b
5    c
dtype: object

In [60]:
datap1.iloc[1]

'b'

In [61]:
datap1.iloc[5]

IndexError: single positional indexer is out-of-bounds

In [62]:
datap1.iloc[0:3]

1    a
3    b
5    c
dtype: object

## Pandas DataFrame

### Creating dataframe from list

In [63]:
l1 = [1,4,577,343]
l1

[1, 4, 577, 343]

In [64]:
datfr1 = pd.DataFrame(l1, columns=['degisken_ismi1'])
datfr1

   degisken_ismi1
0               1
1               4
2             577
3             343

In [65]:
datfr1.axes

[RangeIndex(start=0, stop=4, step=1),
 Index(['degisken_ismi1'], dtype='object')]

In [66]:
datfr1.shape

(4, 1)

In [67]:
datfr1.ndim

2

In [68]:
datfr1.size

4

In [69]:
datfr1.values

array([[  1],
       [  4],
       [577],
       [343]])

In [70]:
datfr1.head(2)

   degisken_ismi1
0               1
1               4

In [71]:
datfr1.tail(2)

   degisken_ismi1
2             577
3             343

In [72]:
arr1 = np.array([1,2,3,4,5])

In [73]:
pd.DataFrame(arr1, columns=['deg_ism'])

   deg_ism
0        1
1        2
2        3
3        4
4        5

### Creating dataframe from array

In [74]:
arr2 = np.arange(1,10).reshape((3,3))
arr2

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [75]:
pd.DataFrame(arr2, columns=['var1', 'var2', 'var3'])

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [76]:
datfr2 = pd.DataFrame(arr2, columns=['var1', 'var2', 'var3'])

In [77]:
datfr2

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [78]:
datfr2.columns

Index(['var1', 'var2', 'var3'], dtype='object')

In [79]:
datfr2.columns = 'deg1', 'deg2', 'deg3'

In [80]:
datfr2

   deg1  deg2  deg3
0     1     2     3
1     4     5     6
2     7     8     9

In [81]:
pd.DataFrame(arr2, columns=['var1', 'var2', 'var3'], index = ['a','b','c'])

   var1  var2  var3
a     1     2     3
b     4     5     6
c     7     8     9

### Creating dataframe from pandas series

In [82]:
pd.Series([1,2,3,4])

0    1
1    2
2    3
3    4
dtype: int64

In [83]:
pd.DataFrame(pd.Series([1,2,3,4]), columns=['degisken'])

   degisken
0         1
1         2
2         3
3         4

In [84]:
seribir = pd.Series([1,2,3,4])
seriiki = pd.Series([5,6,7,8])

In [85]:
pd.DataFrame({'degs1': seribir,
             'degs2': seriiki})

   degs1  degs2
0      1      5
1      2      6
2      3      7
3      4      8

### Creating dataframe from dictionary

In [86]:
sozlk1 = {"reg" : {"RMSE": 10,
                  "MSE": 11,
                  "SSE": 90},
         
         "loj" : {"RMSE": 89,
                 "MSE": 12,
                 "SSE": 45},
         
         "cart" : {"RMSE": 45,
                  "MSE": 22,
                  "SSE": 11}}

In [87]:
pd.DataFrame(sozlk1)

      reg  loj  cart
RMSE   10   89    45
MSE    11   12    22
SSE    90   45    11

### DataFrame element operations

In [88]:
ary1 = np.random.randint(10, size=5)
ary2 = np.random.randint(10, size=5)
ary3 = np.random.randint(10, size=5)

dfr1 = pd.DataFrame({"var1": ary1, "var2": ary2, "var3": ary3})
dfr1

   var1  var2  var3
0     6     7     8
1     8     4     9
2     8     5     2
3     5     1     9
4     1     3     4

#### Getting observations

In [89]:
dfr1[0:1]

   var1  var2  var3
0     6     7     8

In [90]:
dfr1.index = ["a","b","c","d","e"]

In [91]:
dfr1

   var1  var2  var3
a     6     7     8
b     8     4     9
c     8     5     2
d     5     1     9
e     1     3     4

In [92]:
dfr1['c':'e']

   var1  var2  var3
c     8     5     2
d     5     1     9
e     1     3     4

In [93]:
dfr1.drop('a', axis=0)

   var1  var2  var3
b     8     4     9
c     8     5     2
d     5     1     9
e     1     3     4

In [94]:
dfr1

   var1  var2  var3
a     6     7     8
b     8     4     9
c     8     5     2
d     5     1     9
e     1     3     4

**for a permanent change:**

In [95]:
dfr1.drop('a', axis=0, inplace=True)

In [96]:
dfr1

   var1  var2  var3
b     8     4     9
c     8     5     2
d     5     1     9
e     1     3     4

In [97]:
l3 = ["b","c"]

In [98]:
l3

['b', 'c']

In [99]:
dfr1.drop(l3,axis=0)

   var1  var2  var3
d     5     1     9
e     1     3     4

In [100]:
dfr1

   var1  var2  var3
b     8     4     9
c     8     5     2
d     5     1     9
e     1     3     4

#### Getting variables

In [101]:
'var1' in dfr1

True

In [102]:
l3 = ['var1', 'var2', 'var4']

In [103]:
for i in l3:
    print(i in dfr1)

True
True
False

**check if two variables are same or not:**

In [104]:
dfr1['var1'] is dfr1['var1']

True

**choosing variable by dictionary type choosing and attributes typechoosing:**

In [105]:
dfr1['var2']

b    4
c    5
d    1
e    3
Name: var2, dtype: int64

In [106]:
dfr1.var1

b    8
c    8
d    5
e    1
Name: var1, dtype: int64

In [107]:
dfr1[['var1', 'var2']]

   var1  var2
b     8     4
c     8     5
d     5     1
e     1     3

In [108]:
l4 = ['var1', 'var2']

In [109]:
dfr1[l4]

   var1  var2
b     8     4
c     8     5
d     5     1
e     1     3

**adding a new variable:**

In [110]:
dfr1

   var1  var2  var3
b     8     4     9
c     8     5     2
d     5     1     9
e     1     3     4

In [111]:
dfr1['var4'] = dfr1['var1'] / dfr1['var2']

In [112]:
dfr1

   var1  var2  var3      var4
b     8     4     9  2.000000
c     8     5     2  1.600000
d     5     1     9  5.000000
e     1     3     4  0.333333

In [113]:
dfr1.drop('var4', axis=1)

   var1  var2  var3
b     8     4     9
c     8     5     2
d     5     1     9
e     1     3     4

In [114]:
dfr1

   var1  var2  var3      var4
b     8     4     9  2.000000
c     8     5     2  1.600000
d     5     1     9  5.000000
e     1     3     4  0.333333

**for adding a variabla permanently, use "inplace":**

In [115]:
dfr1.drop('var4', axis=1, inplace=True)

In [116]:
dfr1

   var1  var2  var3
b     8     4     9
c     8     5     2
d     5     1     9
e     1     3     4

In [117]:
dfr1.drop(l4, axis=1)

   var3
b     9
c     2
d     9
e     4

#### Getting observations and variables together

In [118]:
sar1 = np.random.randint(10, size=5)
sar2 = np.random.randint(10, size=5)
sar3 = np.random.randint(10, size=5)
dfr4 = pd.DataFrame({"var1": sar1, 'var2': sar2, 'var3': sar3})
dfr4

   var1  var2  var3
0     4     7     4
1     5     0     3
2     8     3     7
3     5     8     0
4     6     7     0

In [119]:
dfr4.loc[0:3]

   var1  var2  var3
0     4     7     4
1     5     0     3
2     8     3     7
3     5     8     0

In [120]:
dfr4.iloc[0:3]

   var1  var2  var3
0     4     7     4
1     5     0     3
2     8     3     7

In [121]:
dfr4.iloc[0,0]

4

In [122]:
dfr4.iloc[:3,:2]

   var1  var2
0     4     7
1     5     0
2     8     3

In [123]:
dfr4.iloc[2:6,1:3]

   var2  var3
2     3     7
3     8     0
4     7     0

In [124]:
dfr4.loc[0:3, 'var3']

0    4
1    3
2    7
3    0
Name: var3, dtype: int64

In [125]:
dfr4.loc[0:3, 'var2':'var3']

   var2  var3
0     7     4
1     0     3
2     3     7
3     8     0

In [126]:
dfr4[0:3, 'var2':'var3']

TypeError: '(slice(0, 3, None), slice('var2', 'var3', None))' is an invalid key

**!!! for both obs and var choosing; use loc or iloc !!!**

In [127]:
dfr4.index = ["a", "b", "c", "d", "e"]
dfr4

   var1  var2  var3
a     4     7     4
b     5     0     3
c     8     3     7
d     5     8     0
e     6     7     0

In [128]:
dfr4.iloc["c":"d", "var":"var3"]

TypeError: cannot do slice indexing on <class 'pandas.core.indexes.base.Index'> with these indexers [c] of <class 'str'>

**iloc doesn't work; use loc!**

In [129]:
dfr4.loc["c":"d", "var":"var3"]

   var1  var2  var3
c     8     3     7
d     5     8     0

### Conditional operations

In [130]:
dfr4

   var1  var2  var3
a     4     7     4
b     5     0     3
c     8     3     7
d     5     8     0
e     6     7     0

In [131]:
dfr4[dfr4.var1>5]['var2']

c    3
e    7
Name: var2, dtype: int64

In [132]:
dfr4[(dfr4.var1 > 5) & (dfr4.var3 < 7)]

   var1  var2  var3
e     6     7     0

In [133]:
dfr4[dfr4.var1>5]['var1','var2']

KeyError: ('var1', 'var2')

**!!! error! use loc or iloc !!!**

In [134]:
dfr4.loc[dfr4.var1 > 5, ['var1','var2']]

   var1  var2
c     8     3
e     6     7

### Joining Operations

#### Concat

In [135]:
sarr1 = np.random.randint(10, size=5)
sarr2 = np.random.randint(10, size=5)
sarr3 = np.random.randint(10, size=5)
dfr5 = pd.DataFrame({"var1": sarr1, 'var2': sarr2, 'var3': sarr3})
dfr5

   var1  var2  var3
0     0     7     5
1     2     5     2
2     9     3     6
3     4     9     3
4     5     3     1

In [136]:
dfr6 = dfr5 + 99
dfr6

   var1  var2  var3
0    99   106   104
1   101   104   101
2   108   102   105
3   103   108   102
4   104   102   100

In [137]:
pd.concat([dfr5,dfr6])

   var1  var2  var3
0     0     7     5
1     2     5     2
2     9     3     6
3     4     9     3
4     5     3     1
0    99   106   104
1   101   104   101
2   108   102   105
3   103   108   102
4   104   102   100

In [138]:
pd.concat([dfr5,dfr6], axis=1)

   var1  var2  var3  var1  var2  var3
0     0     7     5    99   106   104
1     2     5     2   101   104   101
2     9     3     6   108   102   105
3     4     9     3   103   108   102
4     5     3     1   104   102   100

**adding one under the other causes index problem; use "ignore_index"**

In [140]:
pd.concat([dfr5,dfr6], ignore_index=True)

   var1  var2  var3
0     0     7     5
1     2     5     2
2     9     3     6
3     4     9     3
4     5     3     1
5    99   106   104
6   101   104   101
7   108   102   105
8   103   108   102
9   104   102   100

In [141]:
dfr6.columns = ["var1","var2","deg3"]
dfr6

   var1  var2  deg3
0    99   106   104
1   101   104   101
2   108   102   105
3   103   108   102
4   104   102   100

In [142]:
dfr5

   var1  var2  var3
0     0     7     5
1     2     5     2
2     9     3     6
3     4     9     3
4     5     3     1

In [143]:
pd.concat([dfr5,dfr6])

/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

    deg3  var1  var2  var3
0    NaN     0     7   5.0
1    NaN     2     5   2.0
2    NaN     9     3   6.0
3    NaN     4     9   3.0
4    NaN     5     3   1.0
0  104.0    99   106   NaN
1  101.0   101   104   NaN
2  105.0   108   102   NaN
3  102.0   103   108   NaN
4  100.0   104   102   NaN

**if we change the name of a variable; it fills the cells with NA**

In [144]:
pd.concat([dfr5,dfr6], join='inner')

   var1  var2
0     0     7
1     2     5
2     9     3
3     4     9
4     5     3
0    99   106
1   101   104
2   108   102
3   103   108
4   104   102

**doing based on dfr5 variables:**

In [145]:
pd.concat([dfr5,dfr6], join_axes=[dfr5.columns])

/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning: The join_axes-keyword is deprecated. Use .reindex or .reindex_like on the result to achieve the same functionality.
  """Entry point for launching an IPython kernel.

   var1  var2  var3
0     0     7   5.0
1     2     5   2.0
2     9     3   6.0
3     4     9   3.0
4     5     3   1.0
0    99   106   NaN
1   101   104   NaN
2   108   102   NaN
3   103   108   NaN
4   104   102   NaN

#### Merge and join

In [146]:
datf1 = pd.DataFrame({'calisanlar': ['ali', 'veli', 'ayse', 'fatma'], 'grup': ['muhasebe', 'muhendislik', 'muhendislik', 'ik']})
datf1

  calisanlar         grup
0        ali     muhasebe
1       veli  muhendislik
2       ayse  muhendislik
3      fatma           ik

In [147]:
datf2 = pd.DataFrame({'calisanlar': ['ayse', 'ali', 'veli', 'fatma'], 'ilk_giris': [2010, 2009, 2014, 2019]})
datf2

  calisanlar  ilk_giris
0       ayse       2010
1        ali       2009
2       veli       2014
3      fatma       2019

In [148]:
datf3 = pd.DataFrame({'grup': ['muhasebe', 'muhendislik', 'ik'], 'mudur': ['caner', 'mustafa', 'berke']})
datf3

          grup    mudur
0     muhasebe    caner
1  muhendislik  mustafa
2           ik    berke

In [149]:
datf4 = pd.DataFrame({'grup': ['muhasebe', 'muhasebe', 'muhendislik', 'muhendislik', 'ik', 'ik'], 'yetenekler': ['matematik', 'excel', 'kodlama', 'linux', 'excel', 'yonetim']})
datf4

          grup yetenekler
0     muhasebe  matematik
1     muhasebe      excel
2  muhendislik    kodlama
3  muhendislik      linux
4           ik      excel
5           ik    yonetim

**one-to-one merge:**

In [192]:
pd.merge(datf1,datf2)

  calisanlar         grup  ilk_giris
0        ali     muhasebe       2009
1       veli  muhendislik       2014
2       ayse  muhendislik       2010
3      fatma           ik       2019

hangi degiskende birlestirmek istedigimizi on ile belirtebiliriz

In [193]:
pd.merge(datf1,datf2, on='calisanlar')

  calisanlar         grup  ilk_giris
0        ali     muhasebe       2009
1       veli  muhendislik       2014
2       ayse  muhendislik       2010
3      fatma           ik       2019

**many-to-one merge:**

In [150]:
datf5 = pd.merge(datf1,datf2)
datf5

  calisanlar         grup  ilk_giris
0        ali     muhasebe       2009
1       veli  muhendislik       2014
2       ayse  muhendislik       2010
3      fatma           ik       2019

In [151]:
datf3

          grup    mudur
0     muhasebe    caner
1  muhendislik  mustafa
2           ik    berke

In [152]:
pd.merge(datf5,datf3)

  calisanlar         grup  ilk_giris    mudur
0        ali     muhasebe       2009    caner
1       veli  muhendislik       2014  mustafa
2       ayse  muhendislik       2010  mustafa
3      fatma           ik       2019    berke

**many-to-many merge:**

In [153]:
datf4

          grup yetenekler
0     muhasebe  matematik
1     muhasebe      excel
2  muhendislik    kodlama
3  muhendislik      linux
4           ik      excel
5           ik    yonetim

In [154]:
datf1

  calisanlar         grup
0        ali     muhasebe
1       veli  muhendislik
2       ayse  muhendislik
3      fatma           ik

In [155]:
pd.merge(datf1,datf4)

  calisanlar         grup yetenekler
0        ali     muhasebe  matematik
1        ali     muhasebe      excel
2       veli  muhendislik    kodlama
3       veli  muhendislik      linux
4       ayse  muhendislik    kodlama
5       ayse  muhendislik      linux
6      fatma           ik      excel
7      fatma           ik    yonetim

In [156]:
datf6 = pd.DataFrame({'name': ['ali', 'veli', 'ayse', 'fatma'], 'maas': [7000, 8000, 12000, 90000]})
datf6

    name   maas
0    ali   7000
1   veli   8000
2   ayse  12000
3  fatma  90000

In [157]:
datf1

  calisanlar         grup
0        ali     muhasebe
1       veli  muhendislik
2       ayse  muhendislik
3      fatma           ik

In [158]:
pd.merge(datf6,datf1)

MergeError: No common columns to perform merge on. Merge options: left_on=None, right_on=None, left_index=False, right_index=False

**error because it cannot find common column**

In [159]:
pd.merge(datf1,datf6, left_on = 'calisanlar', right_on = 'name')

  calisanlar         grup   name   maas
0        ali     muhasebe    ali   7000
1       veli  muhendislik   veli   8000
2       ayse  muhendislik   ayse  12000
3      fatma           ik  fatma  90000

**use drop to get rid of one name**

In [160]:
pd.merge(datf1,datf6, left_on = 'calisanlar', right_on = 'name').drop('name', axis=1)

  calisanlar         grup   maas
0        ali     muhasebe   7000
1       veli  muhendislik   8000
2       ayse  muhendislik  12000
3      fatma           ik  90000

**converting a variable into index:**

In [215]:
datf1

  calisanlar         grup
0        ali     muhasebe
1       veli  muhendislik
2       ayse  muhendislik
3      fatma           ik

In [162]:
datf1a = datf1.set_index('calisanlar')
datf1a

                   grup
calisanlar
ali            muhasebe
veli        muhendislik
ayse        muhendislik
fatma                ik

In [163]:
datf1.shape

(4, 2)

In [164]:
datf1a.shape

(4, 1)

In [165]:
datf2

  calisanlar  ilk_giris
0       ayse       2010
1        ali       2009
2       veli       2014
3      fatma       2019

In [166]:
datf2a = datf2.set_index('calisanlar')
datf2a

            ilk_giris
calisanlar
ayse             2010
ali              2009
veli             2014
fatma            2019

**merge by intersecting indexes:**

In [167]:
pd.merge(datf1a,datf2a, left_index=True, right_index=True)

                   grup  ilk_giris
calisanlar
ali            muhasebe       2009
veli        muhendislik       2014
ayse        muhendislik       2010
fatma                ik       2019

In [168]:
datf1a.join(datf2a)

                   grup  ilk_giris
calisanlar
ali            muhasebe       2009
veli        muhendislik       2014
ayse        muhendislik       2010
fatma                ik       2019

In [169]:
dfra = pd.DataFrame({'calisanlar': ['ali', 'veli', 'ayse', 'fatma'], 'siralama': [1,2,3,4]})
dfra

  calisanlar  siralama
0        ali         1
1       veli         2
2       ayse         3
3      fatma         4

In [170]:
dfrb = pd.DataFrame({'calisanlar': ['ali', 'veli', 'ayse', 'fatma'], 'siralama': [3,1,4,2]})
dfrb

  calisanlar  siralama
0        ali         3
1       veli         1
2       ayse         4
3      fatma         2

In [171]:
pd.merge(dfra,dfrb, on='calisanlar')

  calisanlar  siralama_x  siralama_y
0        ali           1           3
1       veli           2           1
2       ayse           3           4
3      fatma           4           2

**it gives as _x and _y. we can do change:**

In [172]:
pd.merge(dfra, dfrb, on='calisanlar', suffixes=["_maas", "_deneyim"])

  calisanlar  siralama_maas  siralama_deneyim
0        ali              1                 3
1       veli              2                 1
2       ayse              3                 4
3      fatma              4                 2

### Aggregation

In [173]:
import seaborn as sns

In [174]:
aggr1 = sns.load_dataset('planets')

In [175]:
aggr1.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [176]:
aggr1.shape

(1035, 6)

**getting number of variables and getting count of a particular variable:**

In [177]:
aggr1.count()

method            1035
number            1035
orbital_period     992
mass               513
distance           808
year              1035
dtype: int64

In [180]:
aggr1['mass'].count()

513

In [181]:
aggr1.describe()

            number  orbital_period        mass     distance         year
count  1035.000000      992.000000  513.000000   808.000000  1035.000000
mean      1.785507     2002.917596    2.638161   264.069282  2009.070531
std       1.240976    26014.728304    3.818617   733.116493     3.972567
min       1.000000        0.090706    0.003600     1.350000  1989.000000
25%       1.000000        5.442540    0.229000    32.560000  2007.000000
50%       1.000000       39.979500    1.260000    55.250000  2010.000000
75%       2.000000      526.005000    3.040000   178.500000  2012.000000
max       7.000000   730000.000000   25.000000  8500.000000  2014.000000

In [182]:
aggr1.describe()

            number  orbital_period        mass     distance         year
count  1035.000000      992.000000  513.000000   808.000000  1035.000000
mean      1.785507     2002.917596    2.638161   264.069282  2009.070531
std       1.240976    26014.728304    3.818617   733.116493     3.972567
min       1.000000        0.090706    0.003600     1.350000  1989.000000
25%       1.000000        5.442540    0.229000    32.560000  2007.000000
50%       1.000000       39.979500    1.260000    55.250000  2010.000000
75%       2.000000      526.005000    3.040000   178.500000  2012.000000
max       7.000000   730000.000000   25.000000  8500.000000  2014.000000

**we can use:**

count()

first()

last()

mean()

median()

min()

max()

std()

var()

In [183]:
aggr1['mass'].describe()

count    513.000000
mean       2.638161
std        3.818617
min        0.003600
25%        0.229000
50%        1.260000
75%        3.040000
max       25.000000
Name: mass, dtype: float64

In [184]:
aggr1.mean()

number               1.785507
orbital_period    2002.917596
mass                 2.638161
distance           264.069282
year              2009.070531
dtype: float64

**if there is missing value:**

In [185]:
aggr1.dropna().describe().T

,count,mean,std,min,25%,50%,75%,max
number,498.0,1.734940,1.175720,1.0000,1.00000,1.000,2.0000,6.0
orbital_period,498.0,835.778671,1469.128259,1.3283,38.27225,357.000,999.6000,17337.5
mass,498.0,2.509320,3.636274,0.0036,0.21250,1.245,2.8675,25.0
distance,498.0,52.068213,46.596041,1.3500,24.49750,39.940,59.3325,354.0
year,498.0,2007.377510,4.167284,1989.0000,2005.00000,2009.000,2011.0000,2014.0

### Grouping

In [186]:
import pandas as pd

In [187]:
gru1 = pd.DataFrame({'gruplar': ['A', 'B', 'C', 'A', 'B', 'C'],
                    'veri': [10,11,52,23,43,55]}, columns=['gruplar', 'veri'])
gru1

  gruplar  veri
0       A    10
1       B    11
2       C    52
3       A    23
4       B    43
5       C    55

In [190]:
gru1.groupby('gruplar').sum()

         veri
gruplar
A          33
B          54
C         107

In [191]:
aggr1 = sns.load_dataset('planets')

In [192]:
aggr1.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

**groupby** - used to group dataset according to a categorical variable

In [194]:
aggr1.groupby('method')['orbital_period'].median()

method
Astrometry                         631.180000
Eclipse Timing Variations         4343.500000
Imaging                          27500.000000
Microlensing                      3300.000000
Orbital Brightness Modulation        0.342887
Pulsar Timing                       66.541900
Pulsation Timing Variations       1170.000000
Radial Velocity                    360.200000
Transit                              5.714932
Transit Timing Variations           57.011000
Name: orbital_period, dtype: float64

In [196]:
aggr1.groupby('method')['orbital_period'].sum()

method
Astrometry                       1.262360e+03
Eclipse Timing Variations        4.276480e+04
Imaging                          1.418973e+06
Microlensing                     2.207500e+04
Orbital Brightness Modulation    2.127920e+00
Pulsar Timing                    3.671511e+04
Pulsation Timing Variations      1.170000e+03
Radial Velocity                  4.553151e+05
Transit                          8.377523e+03
Transit Timing Variations        2.393505e+02
Name: orbital_period, dtype: float64

In [197]:
aggr1.groupby('method')['orbital_period'].min()

method
Astrometry                        246.360000
Eclipse Timing Variations        1916.250000
Imaging                          4639.150000
Microlensing                     1825.000000
Orbital Brightness Modulation       0.240104
Pulsar Timing                       0.090706
Pulsation Timing Variations      1170.000000
Radial Velocity                     0.736540
Transit                             0.355000
Transit Timing Variations          22.339500
Name: orbital_period, dtype: float64

ozet bilgi icin:

In [199]:
aggr1.groupby('method')['orbital_period'].describe()

,count,mean,std,min,25%,50%,75%,max
method,,,,,,,,
Astrometry,2.0,631.180000,544.217663,246.360000,438.770000,631.180000,823.590000,1016.000000
Eclipse Timing Variations,9.0,4751.644444,2499.130945,1916.250000,2900.000000,4343.500000,5767.000000,10220.000000
Imaging,12.0,118247.737500,213978.177277,4639.150000,8343.900000,27500.000000,94250.000000,730000.000000
Microlensing,7.0,3153.571429,1113.166333,1825.000000,2375.000000,3300.000000,3550.000000,5100.000000
Orbital Brightness Modulation,3.0,0.709307,0.725493,0.240104,0.291496,0.342887,0.943908,1.544929
Pulsar Timing,5.0,7343.021201,16313.265573,0.090706,25.262000,66.541900,98.211400,36525.000000
Pulsation Timing Variations,1.0,1170.000000,NaN,1170.000000,1170.000000,1170.000000,1170.000000,1170.000000
Radial Velocity,553.0,823.354680,1454.926210,0.736540,38.021000,360.200000,982.000000,17337.500000
Transit,397.0,21.102073,46.185893,0.355000,3.160630,5.714932,16.145700,331.600590
Transit Timing Variations,3.0,79.783500,71.599884,22.339500,39.675250,57.011000,108.505500,160.000000

### Aggregate, filter, transform, apply

**aggregate:**

In [200]:
afta1 = pd.DataFrame({'gruplar': ['A', 'B', 'C', 'A', 'B', 'C'],
                    'degisken1': [10,11,52,23,43,55],
                      'degisken2': [100,110,520,230,430,550]}, columns=['gruplar', 'degisken1', 'degisken2'])
afta1

  gruplar  degisken1  degisken2
0       A         10        100
1       B         11        110
2       C         52        520
3       A         23        230
4       B         43        430
5       C         55        550

In [201]:
import numpy as np

In [202]:
afta1.groupby('gruplar').aggregate(['min', np.median, max])

        degisken1            degisken2
              min median max       min median  max
gruplar
A              10   16.5  23       100    165  230
B              11   27.0  43       110    270  430
C              52   53.5  55       520    535  550

**by using dictionary structure, we can determine which operation will be applied to which variable**

In [203]:
afta1.groupby('gruplar').aggregate({'degisken1': 'min', 'degisken2': 'max'})

         degisken1  degisken2
gruplar
A               10        230
B               11        430
C               52        550

**filter:**

In [204]:
afta1

  gruplar  degisken1  degisken2
0       A         10        100
1       B         11        110
2       C         52        520
3       A         23        230
4       B         43        430
5       C         55        550

In [205]:
def filter_func(x):
    return x['degisken2'].std() > 10

In [206]:
afta1.groupby('gruplar').filter(filter_func)

  gruplar  degisken1  degisken2
0       A         10        100
1       B         11        110
2       C         52        520
3       A         23        230
4       B         43        430
5       C         55        550

**transform:**

In [207]:
afta1

  gruplar  degisken1  degisken2
0       A         10        100
1       B         11        110
2       C         52        520
3       A         23        230
4       B         43        430
5       C         55        550

**standardization** - substract the mean from each value and divide to sdt dev

In [208]:
afta1.groupby('gruplar').transform(lambda x: (x-x.mean()) / x.std())

   degisken1  degisken2
0  -0.707107  -0.707107
1  -0.707107  -0.707107
2  -0.707107  -0.707107
3   0.707107   0.707107
4   0.707107   0.707107
5   0.707107   0.707107

In [209]:
afta1['degisken2']-afta1['degisken2'].mean()

0   -223.333333
1   -213.333333
2    196.666667
3    -93.333333
4    106.666667
5    226.666667
Name: degisken2, dtype: float64

**apply:**

In [210]:
afta1

  gruplar  degisken1  degisken2
0       A         10        100
1       B         11        110
2       C         52        520
3       A         23        230
4       B         43        430
5       C         55        550

In [211]:
afta1.groupby('gruplar').sum()

         degisken1  degisken2
gruplar
A               33        330
B               54        540
C              107       1070

In [212]:
afta1.groupby('gruplar').apply(np.sum)

        gruplar  degisken1  degisken2
gruplar
A            AA         33        330
B            BB         54        540
C            CC        107       1070

**use apply for operations based on rows and columns:**

In [213]:
afta1.apply(np.sum)

gruplar      ABCABC
degisken1       194
degisken2      1940
dtype: object

In [214]:
afta1['degisken1'].sum()

194

In [215]:
afta1['degisken2'].sum()

1940

In [216]:
afta1[['degisken1','degisken2']].apply(np.sum)

degisken1     194
degisken2    1940
dtype: int64

**default apply** -> axis=0 -> it takes colums. for row-based operations; add "axis=1"

In [217]:
afta1[['degisken1', 'degisken2']].apply(np.sum, axis=1)

0    110
1    121
2    572
3    253
4    473
5    605
dtype: int64

In [218]:
afta1

  gruplar  degisken1  degisken2
0       A         10        100
1       B         11        110
2       C         52        520
3       A         23        230
4       B         43        430
5       C         55        550

In [219]:
afta1.groupby('gruplar').apply(np.mean)

         degisken1  degisken2
gruplar
A             16.5      165.0
B             27.0      270.0
C             53.5      535.0

**we can create a list and group a dataset according to this list. it is like a new indexing. but; row counts must me same!**

In [220]:
Li = [0,1,0,1,2,0]

In [221]:
afta1

  gruplar  degisken1  degisken2
0       A         10        100
1       B         11        110
2       C         52        520
3       A         23        230
4       B         43        430
5       C         55        550

In [222]:
afta1.groupby(Li).sum()

   degisken1  degisken2
0        117       1170
1         34        340
2         43        430

### Pivot tables

multiple-dim of groupby

In [223]:
import pandas as pd
import seaborn as sns

In [224]:
titanic = sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [225]:
titanic.groupby('sex')[['survived']].mean()

        survived
sex
female  0.742038
male    0.188908

In [226]:
titanic.groupby(['sex', 'class'])['survived'].aggregate('mean')

sex     class
female  First     0.968085
        Second    0.921053
        Third     0.500000
male    First     0.368852
        Second    0.157407
        Third     0.135447
Name: survived, dtype: float64

**we grouped the data according to "class" and "sex", then got mean of "survived"**

In [228]:
titanic.groupby(['sex', 'class'])['survived'].aggregate('mean').unstack

<bound method Series.unstack of sex     class
female  First     0.968085
        Second    0.921053
        Third     0.500000
male    First     0.368852
        Second    0.157407
        Third     0.135447
Name: survived, dtype: float64>

**we can do this operation by pivot:**

In [229]:
titanic.pivot_table('survived', index='sex', columns='class')

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [232]:
titanic.pivot_table('survived', ['sex', age], 'class')

NameError: name 'age' is not defined

burada age'e tırnak koymama sebebi, surekli degisken (sayısal) olması. burda surekş, degiskeni age'i kategorik degiskene cevirmis olduk. satırlara boyut eklemis olduk. sutunlara da eklemek istersek?

surekli degiskeni kategorik degiskene cevirmenin bi yolu qcut kullanmak - quintile'lara gore boler

In [ ]:
fare = pd.qcut(titanic['fare'], 2, labels=["ucuz", "pahalı"])
fare.head()

cok boyutlu pivot tablo:

In [ ]:
titanic.pivot_table('survived', ['sex', age], [fare, 'class'])

sayısal (surekli) degiskenleri tırnak icinde vermeyiz. kategorik degiskenler tırnak icinde verilir.

margin toplamları cok onemli:

In [ ]:
titanic.pivot_table(index = 'sex', columns = 'class',
                   aggfunc = {'survived' : sum, 'fare': 'mean'})

In [ ]:
titanic.pivot_table('survived', index = 'sex', columns = 'class', margins = True)

## Data reading

**frequently encountered data:** csv, txt, excel

**to see working directory:**

In [233]:
pwd

'/Users/Sigirnita/Desktop/Data Science/DS MVK/2 Python Programming/python'

In [234]:
import pandas as pd

In [235]:
pd.read_csv('foldername/filename.csv', sep=';')

FileNotFoundError: [Errno 2] File b'klasoradi/dosyaadi.csv' does not exist: b'klasoradi/dosyaadi.csv'

In [ ]:
pd.read_txt('foldername/filename.txt')

In [ ]:
pd.read_excel('foldername/filename.xlsx')

# References

https://pandas.pydata.org/

coursera.com / Python for Genomic Data Science

udemy.com / Data science and machine learning by Mustafa Vahit KEskin